In [96]:
import pandas as pd

In [97]:
import numpy as np

In [98]:
data=pd.read_csv(r"C:\Users\archana\OneDrive\Desktop\raw_students.csv")

In [99]:
data

   StudentID          Name     Age  Gender  Score                Email
0          1      John doe      20    male   85.0     john@example.com
1          2   Jane Smith       19  Female   90.0  janesmith@email.com
2          3   Bob Johnson     NaN    Male   78.0       bobj@email.com
3          4   Alice Brown      21  Female    NaN      alice@email.com
4          5     Chris Lee  twenty    Male   88.0          chris@email
5          6      John Doe      20    Male   85.0     john@example.com
6          7           NaN      22  Female   92.0      sarah@email.com
7          8  Michael King      23    Male   75.0    michael@email.com

In [100]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   StudentID  8 non-null      int64
 1   Name       7 non-null      object
 2   Age        7 non-null      object
 3   Gender     8 non-null      object
 4   Score      7 non-null      float64
 5   Email      8 non-null      object
dtypes: float64(1), int64(1), object(4)
memory usage: 516.0+ bytes

In [101]:
data["Age"]=pd.to_numeric(data["Age"],errors="coerce")

In [102]:
data.dtypes

StudentID      int64
Name          object
Age          float64
Gender        object
Score        float64
Email         object
dtype: object

In [103]:
data

   StudentID          Name   Age  Gender  Score                Email
0          1      John doe  20.0    male   85.0     john@example.com
1          2   Jane Smith   19.0  Female   90.0  janesmith@email.com
2          3   Bob Johnson   NaN    Male   78.0       bobj@email.com
3          4   Alice Brown  21.0  Female    NaN      alice@email.com
4          5     Chris Lee   NaN    Male   88.0          chris@email
5          6      John Doe  20.0    Male   85.0     john@example.com
6          7           NaN  22.0  Female   92.0      sarah@email.com
7          8  Michael King  23.0    Male   75.0    michael@email.com

In [104]:
data.isnull().sum()

StudentID    0
Name         1
Age          2
Gender       0
Score        1
Email        0
dtype: int64

In [105]:
data["Age"] = data["Age"].fillna(data["Age"].mean())
data

   StudentID          Name        Age  Gender  Score                Email
0          1      John doe  20.000000    male   85.0     john@example.com
1          2   Jane Smith   19.000000  Female   90.0  janesmith@email.com
2          3   Bob Johnson  20.833333    Male   78.0       bobj@email.com
3          4   Alice Brown  21.000000  Female    NaN      alice@email.com
4          5     Chris Lee  20.833333    Male   88.0          chris@email
5          6      John Doe  20.000000    Male   85.0     john@example.com
6          7           NaN  22.000000  Female   92.0      sarah@email.com
7          8  Michael King  23.000000    Male   75.0    michael@email.com

In [106]:
data["Score"] = data["Score"].fillna(data["Score"].median())

In [107]:
data

   StudentID          Name        Age  Gender  Score                Email
0          1      John doe  20.000000    male   85.0     john@example.com
1          2   Jane Smith   19.000000  Female   90.0  janesmith@email.com
2          3   Bob Johnson  20.833333    Male   78.0       bobj@email.com
3          4   Alice Brown  21.000000  Female   85.0      alice@email.com
4          5     Chris Lee  20.833333    Male   88.0          chris@email
5          6      John Doe  20.000000    Male   85.0     john@example.com
6          7           NaN  22.000000  Female   92.0      sarah@email.com
7          8  Michael King  23.000000    Male   75.0    michael@email.com

In [108]:
data["Email"] = data["Email"].apply(
    lambda x: x + ".com" if pd.notnull(x) and not x.endswith(".com") else x
)
#data
data.loc[4, "Email"] = data.loc[4, "Email"] + ".com"

In [109]:
data["Age"]=data["Age"].astype("int")

In [110]:
data

   StudentID          Name  Age  Gender  Score                Email
0          1      John doe   20    male   85.0     john@example.com
1          2   Jane Smith    19  Female   90.0  janesmith@email.com
2          3   Bob Johnson   20    Male   78.0       bobj@email.com
3          4   Alice Brown   21  Female   85.0      alice@email.com
4          5     Chris Lee   20    Male   88.0  chris@email.com.com
5          6      John Doe   20    Male   85.0     john@example.com
6          7           NaN   22  Female   92.0      sarah@email.com
7          8  Michael King   23    Male   75.0    michael@email.com

In [111]:
data["Score"]=data["Score"].astype("int")

In [112]:
data

   StudentID          Name  Age  Gender  Score                Email
0          1      John doe   20    male     85     john@example.com
1          2   Jane Smith    19  Female     90  janesmith@email.com
2          3   Bob Johnson   20    Male     78       bobj@email.com
3          4   Alice Brown   21  Female     85      alice@email.com
4          5     Chris Lee   20    Male     88  chris@email.com.com
5          6      John Doe   20    Male     85     john@example.com
6          7           NaN   22  Female     92      sarah@email.com
7          8  Michael King   23    Male     75    michael@email.com

In [113]:
data["Name"]=data["Name"].fillna("unknown")

In [114]:
data

   StudentID          Name  Age  Gender  Score                Email
0          1      John doe   20    male     85     john@example.com
1          2   Jane Smith    19  Female     90  janesmith@email.com
2          3   Bob Johnson   20    Male     78       bobj@email.com
3          4   Alice Brown   21  Female     85      alice@email.com
4          5     Chris Lee   20    Male     88  chris@email.com.com
5          6      John Doe   20    Male     85     john@example.com
6          7       unknown   22  Female     92      sarah@email.com
7          8  Michael King   23    Male     75    michael@email.com

In [115]:
data.loc[data["Name"] == "John doe", "Name"] = "John Doe"
data

   StudentID          Name  Age  Gender  Score                Email
0          1      John Doe   20    male     85     john@example.com
1          2   Jane Smith    19  Female     90  janesmith@email.com
2          3   Bob Johnson   20    Male     78       bobj@email.com
3          4   Alice Brown   21  Female     85      alice@email.com
4          5     Chris Lee   20    Male     88  chris@email.com.com
5          6      John Doe   20    Male     85     john@example.com
6          7       unknown   22  Female     92      sarah@email.com
7          8  Michael King   23    Male     75    michael@email.com

In [116]:
data =data.iloc[:,1:]

In [117]:
b= data.copy()

In [118]:
b.head(10)

           Name  Age  Gender  Score                Email
0      John Doe   20    male     85     john@example.com
1   Jane Smith    19  Female     90  janesmith@email.com
2   Bob Johnson   20    Male     78       bobj@email.com
3   Alice Brown   21  Female     85      alice@email.com
4     Chris Lee   20    Male     88  chris@email.com.com
5      John Doe   20    Male     85     john@example.com
6       unknown   22  Female     92      sarah@email.com
7  Michael King   23    Male     75    michael@email.com

In [119]:
b.drop_duplicates()

           Name  Age  Gender  Score                Email
0      John Doe   20    male     85     john@example.com
1   Jane Smith    19  Female     90  janesmith@email.com
2   Bob Johnson   20    Male     78       bobj@email.com
3   Alice Brown   21  Female     85      alice@email.com
4     Chris Lee   20    Male     88  chris@email.com.com
5      John Doe   20    Male     85     john@example.com
6       unknown   22  Female     92      sarah@email.com
7  Michael King   23    Male     75    michael@email.com

In [120]:
b.Gender = b.Gender.str.title()

In [121]:
b.duplicated().sum()

1

In [122]:
b.drop_duplicates(inplace=True)

In [123]:
b

           Name  Age  Gender  Score                Email
0      John Doe   20    Male     85     john@example.com
1   Jane Smith    19  Female     90  janesmith@email.com
2   Bob Johnson   20    Male     78       bobj@email.com
3   Alice Brown   21  Female     85      alice@email.com
4     Chris Lee   20    Male     88  chris@email.com.com
6       unknown   22  Female     92      sarah@email.com
7  Michael King   23    Male     75    michael@email.com

day 10
Task 1: The Integrity Audit (Missing Values & Duplicates)

In [124]:
import pandas as pd

In [125]:
data = pd.read_csv(r"C:\Users\archana\OneDrive\Desktop\customer_orders.csv")
print("Shape before cleaning:", data.shape)

Shape before cleaning: (8, 5)

In [126]:
print("\nMissing Values Report:")
print(data.isna().sum())

Missing Values Report:
order_id       2
customer_id    0
amount         1
quantity       1
status         0
dtype: int64

In [127]:
numeric_cols = data.select_dtypes(include=['number']).columns
for col in numeric_cols:
    data[col] = data[col].fillna(data[col].median())

In [128]:
duplicates_before = data.duplicated().sum()
print("Duplicate rows found:", duplicates_before)

Duplicate rows found: 1

In [129]:
data = data.drop_duplicates()
data

   order_id  customer_id  amount  quantity     status
0     101.0          501  1200.0       2.0  Completed
1     102.0          502  1500.0       1.0  Completed
2     103.0          503  1800.0       3.0    Pending
3     104.0          504  1500.0       2.0  Completed
4     105.0          505   900.0       2.0  Cancelled
6     106.0          506  2000.0       1.0  Completed
7     103.0          507  1700.0       2.0    Pending

In [130]:
print("Final Shape:", data.shape)

Final Shape: (7, 5)

Task 2: The Type Fixer (Data Type Conversion)

In [131]:
import pandas as pd

In [132]:
data = pd.read_csv(r"C:\Users\archana\OneDrive\Desktop\customer_orders.csv")
print("Before Conversion:\n")
print(data.dtypes)

Before Conversion:

order_id       float64
customer_id      int64
amount         float64
quantity       float64
status          object
dtype: object

In [133]:
data["amount"] = (
    data["amount"]
    .astype(str)
    .str.replace("$", "", regex=False)
    .str.replace(",", "", regex=False)
)

data["amount"] = pd.to_numeric(data["amount"], errors="coerce")

print("After Fixing Amount:\n")
print(data["amount"].dtype)

After Fixing Amount:

float64

In [134]:
data["order_id"] = pd.to_numeric(data["order_id"], errors="coerce")

print(data["order_id"].dtype)

float64

In [135]:
print("Final Data Types:\n")
print(data.dtypes)

Final Data Types:

order_id       float64
customer_id      int64
amount         float64
quantity       float64
status          object
dtype: object

Task 3: The Categorical Standardizer (String Cleaning)

In [137]:
import pandas as pd

data = pd.DataFrame({
    "Location": [
        " New York",
        "new york",
        "NEW YORK ",
        "Los Angeles",
        " los angeles ",
        "LOS ANGELES"
    ]
})

data

        Location
0       New York
1       new york
2      NEW YORK
3    Los Angeles
4   los angeles
5    LOS ANGELES

In [138]:
print("Unique values before cleaning:")
print(data["Location"].unique())

Unique values before cleaning:
[' New York' 'new york' 'NEW YORK ' 'Los Angeles' ' los angeles '
 'LOS ANGELES']

In [139]:
data["Location"] = data["Location"].str.strip().str.title()

In [140]:
print("Unique values after cleaning:")
print(data["Location"].unique())

Unique values after cleaning:
['New York' 'Los Angeles']

In [141]:
data

      Location
0     New York
1     New York
2     New York
3  Los Angeles
4  Los Angeles
5  Los Angeles